БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПаспортныеДанные/ПаспортныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортныеДанные</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДокументВид</name>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументКемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДокументКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииПоМестуЖительства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидДокументаУдостоверяющегоЛичностьККТ/ВидДокументаУдостоверяющегоЛичностьККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаУдостоверяющегоЛичностьККТ</name>
  <enumValues>
    <name>ПаспортГражданинаРФ</name>
    <comment>Паспорт гражданина Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ПаспортГражданинаРФЗаПределамиРФ</name>
    <comment>Паспорт гражданина Российской Федерации, дипломатический паспорт, служебный паспорт, удостоверяющие личность гражданина Российской Федерации за пределами Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ВременноеУдостоверениеЛичностиГражданинаРФ</name>
    <comment>Временное удостоверение личности гражданина Российской Федерации, выдаваемое на период оформления паспорта гражданина Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>СвидетельствоОРожденииГражданинаРФ</name>
    <comment>Свидетельство о рождении гражданина Российской Федерации (для граждан Российской Федерации в возрасте до 14 лет)</comment>
  </enumValues>
  <enumValues>
    <name>ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ</name>
    <comment>Иные документы, признаваемые документами, удостоверяющими личность гражданина Российской Федерации в соответствии с законодательством Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ПаспортИностранногоГражданина</name>
    <comment>Паспорт иностранного гражданина</comment>
  </enumValues>
  <enumValues>
    <name>ИныеДокументыУдостоверяющимиЛичностьИностранногоГражданина</name>
    <comment>Иные документы, признаваемые документами, удостоверяющими личность иностранного гражданина в соответствии с законодательством Российской Федерации и международным договором Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ДокументВыданныйИностраннымГосударствомУдостоверяющегоЛичностьБезГражданства</name>
    <comment>Документ, выданный иностранным государством и признаваемый в соответствии с международным договором Российской Федерации в качестве документа, удостоверяющего личность лица без гражданства.</comment>
  </enumValues>
  <enumValues>
    <name>ВидНаЖительствоДляЛицБезГражданства</name>
    <comment>Вид на жительство (для лиц без гражданства)</comment>
  </enumValues>
  <enumValues>
    <name>РазрешениеНаВременноеПроживаниеДляЛицБезГражданства</name>
    <comment>Разрешение на временное проживание (для лиц без гражданства)</comment>
  </enumValues>
  <enumValues>
    <name>СвидетельствоОРасХодатайстваОПризнанииЛицаБезГражданстваБеженцемНаТерриторииРФ</name>
    <comment>Свидетельство о рассмотрении ходатайства о признании лица без гражданства беженцем на территории Российской Федерации по существу</comment>
  </enumValues>
  <enumValues>
    <name>УдостоверениеБеженца</name>
    <comment>Удостоверение беженца</comment>
  </enumValues>
  <enumValues>
    <name>ИныеДокументыУдостоверяющимиЛичностьЛицБезГражданстваРФ</name>
    <comment>Иные документы, признаваемые документами, удостоверяющими личность лиц без гражданства в соответствии с законодательством Российской Федерации и международным договором Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ДокументУдостовЛичностьЛицаНаПериодРассмотренияЗаявленияОПризнанииГражданиномРФ</name>
    <comment>Документ, удостоверяющий личность лица, не имеющего действительного документа, удостоверяющего личность, на период рассмотрения заявления о признании гражданином Российской Федерации или о приеме в гражданство Российской Федерации</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ДокументыУдостоверяющиеЛичность/ДокументыУдостоверяющиеЛичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыУдостоверяющиеЛичность</name>
  <predefined>
    <items>
      <name>ИМНС14</name>
      <description>Временное удостоверение личности гражданина Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС22</name>
      <description>Загранпаспорт гражданина Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС91</name>
      <description>Иные документы</description>
    </items>
    <items>
      <name>ИМНС21</name>
      <description>Паспорт гражданина Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС10</name>
      <description>Паспорт иностранного гражданина</description>
    </items>
    <items>
      <name>ИМНС15</name>
      <description>Разрешение на временное проживание в Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС03</name>
      <description>Свидетельство о рождении</description>
    </items>
  </predefined>
  <attributes>
    <name>НеИмеетСерию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаСерииДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовДУЛ</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовДУЛРЭМД</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаКодаПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonForms/РеквизитыЧекаККТ/Module.bsl
&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(ПолучитьСтруктуруДляВозврата());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НазваниеРеквизитаККТ") Тогда
		НазваниеРеквизитаККТ = Параметры.НазваниеРеквизитаККТ;
		НастроитьФорму(НазваниеРеквизитаККТ);
	КонецЕсли;
		
	Если Параметры.Свойство("АдресХранилищаДанныхРеквизита") Тогда
		ДанныеХЗ = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаДанныхРеквизита);
		Если ЗначениеЗаполнено(ДанныеХЗ) И ТипЗнч(ДанныеХЗ) = Тип("Структура") Тогда
			Для Каждого КлючИЗначение Из ДанныеХЗ Цикл
				ЭтаФорма[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЦикла;
		Иначе
			Элементы.ФормаУдалить.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда
		ДатаВремяОперации = Параметры.Дата;
	КонецЕсли;
	
	Если Параметры.Свойство("ПерсональныеДанные") Тогда
		Адрес =	Параметры.ПерсональныеДанные.Адрес;
		ИНН = Параметры.ПерсональныеДанные.ИНН;
		Если ЗначениеЗаполнено(ДатаРождения)
			Или ЗначениеЗаполнено(ВидДокумента) 
			Или ЗначениеЗаполнено(ДанныеДокумента)
			Или Не (ЗначениеЗаполнено(ИНН) Или ЗначениеЗаполнено(Адрес))
		Тогда
			ЭтоФизЛицо = Истина;
			КлиентФИО = Параметры.ПерсональныеДанные.КлиентПредставление;
		Иначе
			ПредставлениеКонтрагента = Параметры.ПерсональныеДанные.КлиентПредставление;
			ЭтоФизЛицо = Ложь;
		КонецЕсли;
		
		Если ТипЗнч(Параметры.ПерсональныеДанные.Клиент) = Тип("СправочникСсылка.Клиенты") Тогда
			Клиент = Параметры.ПерсональныеДанные.Клиент;
			ЗаполнитьСведенияПоФизЛицу();
		ИначеЕсли ТипЗнч(Параметры.ПерсональныеДанные.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Контрагент = Параметры.ПерсональныеДанные.Клиент;
			ИнформацияОКонтрагенте = ПолучитьИнформациюОКонтрагенте(Контрагент);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ИнформацияОКонтрагенте, "ПредставлениеКонтрагента, ИНН, Адрес");
		КонецЕсли;
		
		Элементы.ПоляЮрЛица.Доступность =  Не ЭтоФизЛицо;
		Элементы.ПоляФизЛица.Доступность = ЭтоФизЛицо;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСФормамиКлиент.УстановитьОтборСписка("ФизЛицо",  Клиент, ПаспортныеДанные);
	НастроитьГражданство(ВидДокумента); 
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(НазваниеРеквизитаККТ)
	
	Для Каждого СтраницаРеквизита Из Элементы.СтраницыРеквизитов.ПодчиненныеЭлементы Цикл
		Если СтраницаРеквизита.Имя = "Страница" + НазваниеРеквизитаККТ Тогда
			СтраницаРеквизита.Видимость = Истина;
		Иначе
			СтраницаРеквизита.Видимость = Ложь;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДляВозврата()
	
	СтруктураДанных = Новый Структура;
	Если НазваниеРеквизитаККТ = "ПерсональныеДанныеПокупателя" Тогда
		СтруктураДанных.Вставить("ДетальнаяИнформация", ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПерсональныеДанныеПокупателя());
		Если Не ЭтоФизЛицо Тогда
			Клиент = Неопределено;
			КлиентФИО = Неопределено;
			ДатаРождения = Неопределено;
			ВидДокумента = Неопределено;
			Гражданство = Неопределено;
			ДанныеДокумента = Неопределено;
			СтруктураДанных.Вставить("Клиент", ПредставлениеКонтрагента);
			СтруктураДанных.Вставить("Адрес", Адрес);
		Иначе
			Контрагент = Неопределено;
			ПредставлениеКонтрагента = Неопределено;
			ИНН	= Неопределено;
			Адрес = Неопределено;
			СтруктураДанных.Вставить("Клиент", КлиентФИО);
			СтруктураДанных.Вставить("Адрес", "");
		КонецЕсли;
	ИначеЕсли НазваниеРеквизитаККТ = "ОперационныйРеквизит" Тогда
		СтруктураДанных.Вставить("ДетальнаяИнформация", ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперационныйРеквизит());
	ИначеЕсли НазваниеРеквизитаККТ = "ОтраслевойРеквизит" Тогда
		СтруктураДанных.Вставить("ДетальнаяИнформация", ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОтраслевойРеквизит());
	Иначе
		СтруктураДанных.Вставить("ДетальнаяИнформация", Новый Структура());
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СтруктураДанных.ДетальнаяИнформация Цикл
		Если КлючИЗначение.Ключ = "ДанныеДокумента" Тогда
			// Паспортные данные. На форме остается текст с переносами, но здесь для реквизита документа и отправки в кассу 
			// заменяются переносы строк на пробелы (факты проблем с АТОЛ).
			ЭтаФорма[КлючИЗначение.Ключ] = СтрЗаменить(ЭтаФорма[КлючИЗначение.Ключ], Символы.ПС, " ");
		КонецЕсли;
		СтруктураДанных.ДетальнаяИнформация.Вставить(КлючИЗначение.Ключ, ЭтаФорма[КлючИЗначение.Ключ]);
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

#Область СведенияОПокупателе

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	РаботаСФормамиКлиент.УстановитьОтборСписка("ФизЛицо",  Клиент, ПаспортныеДанные);
	ЗаполнитьСведенияПоФизЛицу();
		
КонецПроцедуры	

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	Гражданство = "";
	НастроитьГражданство(ВидДокумента);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияПоФизЛицу()
	
	КлиентФИО = Клиент;
	ДатаРождения = Клиент.ДатаРождения;
	АктуальныеПаспортныеДанные = РегистрыСведений.ПаспортныеДанные.ПолучитьПоследнее(ДатаВремяОперации, Новый Структура("ФизЛицо",Клиент));
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента) Тогда
		ДанныеДокумента = ПолучитьДанныеДокумента(АктуальныеПаспортныеДанные);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ВидДокумента = ОпределитьВидДокумента(АктуальныеПаспортныеДанные.ДокументВид);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияПоПаспортнымДанным(Команда, ПаспортныеДанные = Неопределено)
	ТДПД = Элементы.ПаспортныеДанные.ТекущиеДанные;
	Если ТДПД <> Неопределено Тогда
		ВидДокумента = ОпределитьВидДокумента(ТДПД.ДокументВид);
		Гражданство = "";
		НастроитьГражданство(ВидДокумента);
		ДанныеДокумента = ПолучитьДанныеДокумента(ТДПД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьВидДокумента(ДокументВид)

	СоответствиеДУЛИВИдовДУЛККТ = Новый Соответствие();
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС03"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.СвидетельствоОРожденииГражданинаРФ"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС10"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ПаспортИностранногоГражданина"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС14"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ВременноеУдостоверениеЛичностиГражданинаРФ"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС15"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.РазрешениеНаВременноеПроживаниеДляЛицБезГражданства"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС21"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ПаспортГражданинаРФ"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС22"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ПаспортГражданинаРФЗаПределамиРФ"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ИМНС91"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ"));
	СоответствиеДУЛИВИдовДУЛККТ.Вставить(ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ПустаяСсылка"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ПустаяСсылка"));
	
	Возврат СоответствиеДУЛИВИдовДУЛККТ.Получить(ДокументВид);
	
КонецФункции

&НаКлиенте
Процедура НастроитьГражданство(ВидДокумента)
	
	// Реквизит "гражданство" (тег 1244) включается в состав ФД только в случае, если лицо (покупатель, клиент), не является гражданином РФ.
	Если ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ПаспортГражданинаРФ")
		Или ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ПаспортГражданинаРФЗаПределамиРФ") 
		Или ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ВременноеУдостоверениеЛичностиГражданинаРФ")
		Или ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичностьККТ.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ")
		Тогда
		Элементы.Гражданство.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Гражданство.ТолькоПросмотр = Ложь;				
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДанныеДокумента(ТДПД)
	
	Результат = "";
	Если ЗначениеЗаполнено(ТДПД.ДокументСерия)
		Или ЗначениеЗаполнено(ТДПД.ДокументНомер) 
	Тогда
		Результат = Результат + ТДПД.ДокументСерия + " " + ТДПД.ДокументНомер + Символы.ПС;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТДПД.ДокументДатаВыдачи) Тогда
		Результат = Результат + "Выдан: " + Формат(ТДПД.ДокументДатаВыдачи, "ДЛФ=D") + Символы.ПС;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТДПД.ДокументКодПодразделения) Тогда
		Результат = Результат + "Код подр.: " + ТДПД.ДокументКодПодразделения;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭтоФизЛицоПриИзменении(Элемент = Неопределено)
	
	Элементы.ПоляЮрЛица.Доступность = Не ЭтоФизЛицо;
	Элементы.ПоляФизЛица.Доступность =  ЭтоФизЛицо;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	Закрыть(Новый Структура("Удалить"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)

	ТекстСообщения = "";
	Если Не ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ИННСоответствуетТребованиям(ИНН, СтрДлина(ИНН) <> 12, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ИНН");
		Элементы.Сохранить.Доступность = Ложь;
	Иначе
		Элементы.Сохранить.Доступность = Истина;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьИнформациюОКонтрагенте();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОКонтрагенте(Контрагент)
	
	Информация = Новый Структура("ПредставлениеКонтрагента, ИНН, Адрес");
	
	Если ЗначениеЗаполнено(Контрагент.НаименованиеПолное) Тогда
		Информация.ПредставлениеКонтрагента = Контрагент.НаименованиеПолное;
	Иначе
		Информация.ПредставлениеКонтрагента = Строка(Контрагент);
	КонецЕсли;
	
    Информация.ИНН = Контрагент.ИНН;
	Информация.Адрес = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Контрагент, Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Возврат Информация;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИнформациюОКонтрагенте()
	
	Информация = ПолучитьИнформациюОКонтрагенте(Контрагент);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Информация, "ПредставлениеКонтрагента, ИНН, Адрес");
	
КонецПроцедуры

#КонецОбласти
